#!/usr/bin/env python3
# -*- coding: utf-8 -*-

__author__ = "Bauyrzhan Ospan"
__copyright__ = "Copyright 2018, KazPostBot"
__version__ = "1.0.1"
__maintainer__ = "Bauyrzhan Ospan"
__email__ = "bospan@cleverest.tech"
__status__ = "Development"


from gevent import monkey
monkey.patch_all()


from flask import Flask, render_template, request, Markup, jsonify
from flask_socketio import SocketIO, emit, join_room, leave_room, \
	close_room, rooms, disconnect
import time
import random
from random import sample
import datetime
import socket
import json
from pymongo import MongoClient
import requests
from requests import Request, Session
from threading import Lock


async_mode = None

app = Flask(__name__)
app.config['SECRET_KEY'] = 'secret!'
socketio = SocketIO(app, async_mode=async_mode)
thread = None
thread_lock = Lock()
app.config['JSON_AS_ASCII'] = False

client = MongoClient('mongodb://database:27017/')
db = client.b2u
users = db['users']
problems = db['problems']
msgs = db['messages']
dash = db['dash']
needs = db['needs']
data_now = db['data_now']
sklad = db["sklad"]

# Main page
@app.route("/", methods=["GET", "POST"])
def index():
    return render_template(
        "index.html", **locals())


@socketio.on('connect', namespace='/test')
def test_connect():

    snabjenies = users.find_one({"position": "Снабжение"})
    sklads = users.find_one({"position": "Склад"})
    productions = users.find_one({"position": "Производство"})
    brigadirs = users.find_one({"position": "Бригадир"})

    senddata = {
            "Проложено труб":"3%",
            "Произведено консолей":"1% (27%)",
            "Установлено консолей":"0%",
            "Произведено деталей в общем":"13%",

            "консоль1": {"есть": "20(450)", "надо": "1603"},
            "консоль3": {"есть": "0", "надо": "110"},
            "рш": {"есть": "0", "надо": "10"},
            "крб": {"есть": "0", "надо": "54"},
            "комп": {"есть": "0", "надо": "7"},
            "вак": {"есть": "0", "надо": "6"},
            "кис": {"есть": "0", "надо": "23"},
            
            "Произведено деталей": {"есть": "3", "надо": "23"},
            "Доставлено деталей": {"есть": "0", "надо": "23"},

            "Объекты":
                {
                    "Общее": 
                        {
                            "Проложено труб": {"есть": "340", "надо": "10450"},
                            "Установлено консолей 1": {"есть": "0", "надо": "1603"},
                            "Установлено консолей 3": {"есть": "0", "надо": "110"},
                            "КРБ": {"есть": "0", "надо": "54"},
                            "РШ": {"есть": "0", "надо": "10"},
                            "Ваакум": {"есть": "0", "надо": "6"},
                            "Воздух": {"есть": "0", "надо": "7"},
                            "Кислород": {"есть": "0", "надо": "23"}
                        },
                    "ГКИБ": 
                        {
                            "Проложено труб": {"есть": "0", "надо": "1671"},
                            "Установлено консолей 1": {"есть": "0", "надо": "181"},
                            "Установлено консолей 3": {"есть": "0", "надо": "6"},
                            "КРБ": {"есть": "0", "надо": "7"},
                            "РШ": {"есть": "0", "надо": "2"},
                            "Ваакум": {"есть": "0", "надо": "1"},
                            "Воздух": {"есть": "0", "надо": "1"},
                            "Кислород": {"есть": "0", "надо": "3"}
                        },
                    "МИГ": 
                        {
                            "Проложено труб": {"есть": "260", "надо": "2378"},
                            "Установлено консолей 1": {"есть": "0", "надо": "252"},
                            "Установлено консолей 3": {"есть": "0", "надо": "0"},
                            "КРБ": {"есть": "0", "надо": "8"},
                            "РШ": {"есть": "0", "надо": "3"},
                            "Ваакум": {"есть": "0", "надо": "0"},
                            "Воздух": {"есть": "0", "надо": "0"},
                            "Кислород": {"есть": "0", "надо": "3"}
                        },
                    "ЦГКБ": 
                        {
                            "Проложено труб": {"есть": "0", "надо": "-1"},
                            "Установлено консолей 1": {"есть": "0", "надо": "560"},
                            "Установлено консолей 3": {"есть": "0", "надо": "92"},
                            "КРБ": {"есть": "0", "надо": "10"},
                            "РШ": {"есть": "0", "надо": "2"},
                            "Ваакум": {"есть": "0", "надо": "4"},
                            "Воздух": {"есть": "0", "надо": "5"},
                            "Кислород": {"есть": "0", "надо": "8"}
                        },
                    "БСМП": 
                        {
                            "Проложено труб": {"есть": "0", "надо": "2705"},
                            "Установлено консолей 1": {"есть": "0", "надо": "264"},
                            "Установлено консолей 3": {"есть": "0", "надо": "0"},
                            "КРБ": {"есть": "0", "надо": "16"},
                            "РШ": {"есть": "0", "надо": "1"},
                            "Ваакум": {"есть": "0", "надо": "0"},
                            "Воздух": {"есть": "0", "надо": "0"},
                            "Кислород": {"есть": "0", "надо": "4"}
                        },
                    "ДГКИБ": 
                        {
                            "Проложено труб": {"есть": "80", "надо": "1655"},
                            "Установлено консолей 1": {"есть": "0", "надо": "125"},
                            "Установлено консолей 3": {"есть": "0", "надо": "12"},
                            "КРБ": {"есть": "0", "надо": "5"},
                            "РШ": {"есть": "0", "надо": "1"},
                            "Ваакум": {"есть": "0", "надо": "1"},
                            "Воздух": {"есть": "0", "надо": "1"},
                            "Кислород": {"есть": "0", "надо": "2"}
                        },
                    "ЦФ": 
                        {
                            "Проложено труб": {"есть": "0", "надо": "2041"},
                            "Установлено консолей 1": {"есть": "0", "надо": "221"},
                            "Установлено консолей 3": {"есть": "0", "надо": "0"},
                            "КРБ": {"есть": "0", "надо": "8"},
                            "РШ": {"есть": "0", "надо": "1"},
                            "Ваакум": {"есть": "0", "надо": "0"},
                            "Воздух": {"есть": "0", "надо": "0"},
                            "Кислород": {"есть": "0", "надо": "3"}
                        }
                    
                }
        }

    emit('my response', senddata)
   

# Main flask app
if __name__ == "__main__":
    socketio.run(app, host='0.0.0.0', port=8080, debug=True)